#+TITLE: Supported Languages in Scimax VS Code
#+AUTHOR: Scimax VS Code Team
#+DATE: 2026-01-14
#+STARTUP: overview
#+OPTIONS: toc:2 num:t H:4
#+TODO: ⚠️ 👀 | ✅

*Keybinding Note:* This extension uses Emacs-style keybindings where Ctrl is used on all platforms (not Cmd on Mac), except where explicitly noted. Mac alternatives are shown as Cmd where applicable.

*** ⚠️ Basic Example (Native)

#+BEGIN_SRC python
# Native Python execution
import math

radius = 5
area = math.pi * radius ** 2

print(f"Circle area: {area:.2f}")
#+END_SRC

#+RESULTS:
: Circle area: 78.54

*** ⚠️ Session Example (Jupyter)

#+BEGIN_SRC jupyter-python :session *py-session*
# First block - define variables
data = [1, 2, 3, 4, 5]
print(f"Data initialized: {data}")
#+END_SRC

#+RESULTS:
: Data initialized: [1, 2, 3, 4, 5]

#+BEGIN_SRC jupyter-python :session *py-session*
# Second block - uses variables from first block
import statistics
mean = statistics.mean(data)
print(f"Mean: {mean}")
#+END_SRC

#+RESULTS:
: Mean: 3.0

*** ⚠️ Basic Example

#+BEGIN_SRC javascript
// JavaScript execution
const numbers = [1, 2, 3, 4, 5];
const sum = numbers.reduce((a, b) => a + b, 0);
console.log(`Sum: ${sum}`);
#+END_SRC

#+RESULTS:
: Sum: 15

*** ⚠️ Working with JSON

#+BEGIN_SRC javascript
const data = {
  name: "Scimax",
  version: "1.0",
  features: ["org-mode", "jupyter", "references"]
};

console.log(JSON.stringify(data, null, 2));
#+END_SRC

#+RESULTS:
: {
:   "name": "Scimax",
:   "version": "1.0",
:   "features": [
:     "org-mode",
:     "jupyter",
:     "references"
:   ]
: }

*** ⚠️ Basic Example

#+BEGIN_SRC jupyter-ruby
# Ruby execution
numbers = [1, 2, 3, 4, 5]
squared = numbers.map { |n| n ** 2 }
puts "Squared: #{squared.inspect}"
#+END_SRC

#+RESULTS:
: Squared: [1, 4, 9, 16, 25]

*** ⚠️ Basic Example

#+BEGIN_SRC bash
# List files in current directory
ls -la | head -n 10
#+END_SRC

#+RESULTS:
: total 100
: drwxr-xr-x  5 user staff  160 Jan 14 00:00 .
: drwxr-xr-x 10 user staff  320 Jan 13 23:00 ..

*** ⚠️ Basic Example

#+BEGIN_SRC jupyter-r
# R execution
x <- c(1, 2, 3, 4, 5)
y <- x^2
print(y)
#+END_SRC

#+RESULTS:
: [1]  1  4  9 16 25

*** ⚠️ Basic Example

#+BEGIN_SRC jupyter-rust
// Rust execution
fn factorial(n: u64) -> u64 {
    match n {
        0 | 1 => 1,
        _ => n * factorial(n - 1)
    }
}

println!("Factorial of 5: {}", factorial(5));
#+END_SRC

#+RESULTS:
: Factorial of 5: 120

